#+TITLE: Prime Numbers & Sieve of Eratosthenes
#+DATE: [2026-04-12 Sun]
#+FILETAGS: :math:number_theory:optimization:
#+PROPERTY: header-args:cpp :flags -std=c++17 :results scalar :exports both

** Implementation
#+BEGIN_SRC cpp :results output
  #include <iostream>
  #include <vector>

  void sieve(int n) {
      // Create a boolean vector "isPrime[0..n]" and initialize
      // all entries it as true.
      std::vector<bool> is_prime(n + 1, true);
      is_prime[0] = is_prime[1] = false;

      for (int p = 2; p * p <= n; p++) {
          // If is_prime[p] is not changed, then it is a prime
          if (is_prime[p]) {
              // Update all multiples of p starting from p*p
              // Anything before p² is already handled by smaller primes.
              for (int i = p * p; i <= n; i += p)
                is_prime[i] = false;
          }
      }

      // Print first few primes for verification
      for (int p = 2; p <= 20; p++) {
          if (is_prime[p]) std::cout << p << " ";
      }
  }

  int main() {
      sieve(100);
      return 0;
  }
#+END_SRC

#+RESULTS:
: 2 3 5 7 11 13 17 19

** Implementation
#+BEGIN_SRC cpp :results output
  #include <iostream>
  #include <vector>

  void oddSieve(int n) {
      // Only need space for n/2 numbers
      std::vector<bool> is_prime((n / 2) + 1, true);
      is_prime[0] = false; // 1 is not prime

      for (int i = 1; (2 * i + 1) * (2 * i + 1) <= n; i++) {
          if (is_prime[i]) {
              int p = 2 * i + 1;
              // Mark odd multiples starting from p*p
              // We increment by p because (odd + odd) = even (skip),
              // but (odd + 2*odd) = odd (next multiple to check)
              for (int j = (p * p) / 2; j <= n / 2; j += p)
                  is_prime[j] = false;
          }
      }

      std::cout << "2 "; // Handle the only even prime
      for (int i = 1; i <= n / 2; i++) {
          if (is_prime[i]) std::cout << 2 * i + 1 << " ";
      }
  }

  int main() {
      oddSieve(30);
      return 0;
  }
#+END_SRC

#+RESULTS:
: 2 3 5 7 11 13 17 19 23 29

** Implementation
#+BEGIN_SRC cpp :results output
  #include <iostream>
  #include <vector>
  #include <cmath>
  #include <algorithm>

  void segmentedSieve(long long L, long long R) {
      long long limit = sqrt(R);
      std::vector<bool> mark(limit + 1, true);
      std::vector<long long> primes;

      // Step 1: Standard Sieve up to sqrt(R)
      for (long long p = 2; p <= limit; p++) {
          if (mark[p]) {
              primes.push_back(p);
              for (long long i = p * p; i <= limit; i += p)
                  mark[i] = false;
          }
      }

      // Step 2: Sieve the range [L, R]
      std::vector<bool> is_prime_range(R - L + 1, true);
      if (L == 1) is_prime_range[0] = false;

      for (long long p : primes) {
          // Find the first multiple of p in range [L, R]
          long long first_multiple = (L / p) * p;
          if (first_multiple < L) first_multiple += p;

          // Start marking from the max of (p*p) and first_multiple
          for (long long j = std::max(p * p, first_multiple); j <= R; j += p)
              is_prime_range[j - L] = false;
      }

      // Step 3: Collect results
      for (long long i = 0; i <= R - L; i++) {
          if (is_prime_range[i]) std::cout << L + i << " ";
      }
  }

  int main() {
      segmentedSieve(100, 130);
      return 0;
  }
#+END_SRC

#+RESULTS:
: 101 103 107 109 113 127

